#include<stdio.h>
int main()
{
	int a = 10;
	int b = 20;
	int max = 0;
	max = (a > b ? a : b);
	if (a > b)
		max = a;
	else
		max = b;

	//关系操作符>=大于等于,!=是不等于
	//逻辑操作符：&&叫逻辑与
	//||叫逻辑或
	/*int a = 0;
	int b = 5;
	int c = a || b;
	printf("%d\n", c);*/
}

		//int a = 10;
		///*int b = a++;*///后置++，先使用，
		///*int b = ++a;*/ //在使用++, 前置++直接使用
		//int b = --a;//同上
		//printf("a=%d\n b=%d\n", a, b);//a=9，b=9
		////int a = 0;
		////int b = ~a;//b是有符号的整型，
		//////~按（2进制）位取反
		////// 原码、反码、补码
		//// 负数在内存中存储的时候，存储的是二进制的补码
		//// 
		////1010
		////0101
		////1111111111111111111111111111反码
		////1111111111111111111111111110补码
		////1000000000000000000000000001原码
		//printf("%d\n", b);//使用的，打印的是这个数的原码
		